---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingMultiSegmentWithReporting
source: html/e1a8edec-3ff9-196e-16e6-ffb55a32f35a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingMultiSegmentWithReporting Property

Cannot label multi-segment dimensions with reporting parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId LabelingMultiSegmentWithReporting { get; }
```